{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0015d\u0002\u0000\u0018S(\u0003\u0000\u0000\u0000Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000z(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\b\u0000\u0000\u0000model.pyt\b\u0000\u0000\u0000<lambda>\"\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "elu_1"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["elu_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "elu_2"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["elu_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "elu_3"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["elu_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "elu_4"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["elu_4", 0, 0]]], "name": "dropout_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "elu_5"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["elu_5", 0, 0]]], "name": "dropout_5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1152, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "elu_6"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["elu_6", 0, 0]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "dense_2"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "elu_7"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["elu_7", 0, 0]]], "name": "dropout_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["dropout_7", 0, 0]]], "name": "dense_3"}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "elu_8"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["elu_8", 0, 0]]], "name": "dense_4"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_1"}}